using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Exercise6._3
{
    class Program
    {
        static void Main(string[] args)
        {
            //Дана строка S. Из строки требуется удалить текст, заключенный в фигурные скобки.
            //В строке может быть несколько фрагментов, заключённых в фигурные скобки.
            //Возможно использование вложенных фигурных скобок, необходимо, чтобы программа это учитывала.
            Console.WriteLine("Введите предложение ");
            string startString = Console.ReadLine();
        }
    }
}
